[{
  "ratingScore": 5,
  "reviewTitle": "worth the extra $",
  "reviewDescription": "great quality , good fit for RV 3way fridge replacement ! more expensive yet you get the most fridge for the space !"
},
{
  "ratingScore": 1,
  "reviewTitle": "Brand new with a scratch",
  "reviewDescription": "This thing came pre scratched. There was no tear in the plastic that covered it. There was no damage to the box. There was however a 3 inch scratch that I will have to look at every time I look at this refrigerator. Not happy."
},
{
  "ratingScore": 4,
  "reviewTitle": "Damaged but working fine",
  "reviewDescription": "Love the refrigerator. Works very well. It did come with damage to bottom right corner in the back. I didn't want to return it because the damage will not be seen."
},
{
  "ratingScore": 5,
  "reviewTitle": "It's smaller than a normal fridge",
  "reviewDescription": "Perfect size for a dorm room or a small room in your home. It's perfect for small items that you need more often in game room or out by the pool."
},

{
  "ratingScore": 4,
  "reviewTitle": "Not as big as expected, but a great buy anyway",
  "reviewDescription": "It isn't exactly an apartment sized fridge at 7.5 cubic feet, but it is extremely energy efficient. Luckily, the fridge I got this to replace wasn't as close to dying as I thought, so now I just use both. I got it at a stupid low sale price so I'm not going to complain. It works great and doesn't even draw as much power as my vacuum cleaner."
},

{
  "ratingScore": 2,
  "reviewTitle": "DEFROST automatically?",
  "reviewDescription": "The issue of having this refrigerator after years is whether it is a defrost or not because it is frosty."
},
{
  "ratingScore": 4,
  "reviewTitle": "Small and convenient (it came with an indent)",
  "reviewDescription": "Its small and convenient and keeps the cold evenly. Its energy efficient and price friendly, but I have to agree with other reviewers in that it comes dented. Mine came with a horizontal line as an indentation in the bottom of the front door. I needed the refrigerator and the other benefits surpassed this minus, It is being used in a horse barn tack room, so I did not pay much attention to the line / dent on the door. It looks like when the door was been assembled or when the packaging of the product took place the refrigerator was put against a bar or pushed against something that left that horizontal line imprinted in the front door."
}]