[
{
  "ratingScore": 1,
  "reviewTitle": "One Star",
  "reviewDescription": "The fan makes a very loud noise, also Purolator would not ship to my door , we had to go and pick it up..very disappointing"
},
{
  "ratingScore": 2,
  "reviewTitle": "Buyer beware",
  "reviewDescription": "My mother purchased this for our family as a gift. It was meant to help us increase our cold food storage capacity. When it arrived, and we unpacked it, it turned out to be much smaller than we were expecting. the door shelves are small with low clearance (not enough space to store regular salad dressing bottles) and depending on where you have your main shelves set, the items on the lower door shelf will obstruct the refrigerator door's ability to close. the bottom drawer is very flimsy and binds if not opened perfectly straight. the back panel on the refrigerator freezes and as a result, so does the food in contact with it. and when the frozen condensation melts, it gets water on any food that is in contact with the back panel or sitting on the bottom shelf. usually this happens on my egg cartons, the back end of them are typically soaked and or frozen (fridge temp is set to 3 out of 6) Within a very short period of time, i attempted to return it. WARNING: Amazon does not accept returns for refrigerators. they advised me to contact Danby, Danby does have a return for remorseful customers, but not when purchased through amazon. I want to say this fridge is suitable for a college student, but that may be a bad recommendation considering it has no freezer lol. Very sad to be stuck with this fridge. will sell for cheap and buy a better one. will never buy a refrigerator from amazon if I can help it."
},
{
  "ratingScore": 3,
  "reviewTitle": "Very Noisy!",
  "reviewDescription": "I personally don't like this fridge, but my mom wanted it for her kitchen. It's nice looking, but the fan is going constantly and makes an awful noise. It does keep food cold."
},
{
  "ratingScore": 4,
  "reviewTitle": "Nice basement beverage fridge",
  "reviewDescription": "Perfect size and cost and energy efficiency for a store room beverage fridge. The internal fan would make it a bit noisy for kitchen use."
}]