[{
  "ratingScore": 5,
  "reviewTitle": "100% Top Quality",
  "reviewDescription": "Keeps my Food Cold, Fresh, Frozen💯 Extremely Quiet, just make sure you don't buy Large items."
},
{
  "ratingScore": 4,
  "reviewTitle": "Decent product",
  "reviewDescription": "It's probably a decent product. I didn't bother opening it. I returned it"
},
{
  "ratingScore": 3,
  "reviewTitle": "Not frost free.",
  "reviewDescription": "I bought this for my elderly mother in Assisted Living. I thought a separate freezer would be the answer to it freezing up. However, it is also freezing in the main refrigerator as well. I turned the temperature down and like the other, I had to run the blow dryer to unfreeze it and now I have to do the both the freezer and main refrigerator."
},
{
  "ratingScore": 5,
  "reviewTitle": "Spacious",
  "reviewDescription": "It gets very cold, and works great- it was more spacious than expected"
},
{
  "ratingScore": 5,
  "reviewTitle": "So far so good!",
  "reviewDescription": "really impressed with the size and the capacity. packaging was excellent, arrived in perfect condition. cooling power is really good. Highly recommend it."
},
{
  "ratingScore": 5,
  "reviewTitle": "Excellent small fridge/freezer",
  "reviewDescription": "Perfect for my basement. Runs quietly and temps are where they should be."
},
{
  "ratingScore": 5,
  "reviewTitle": "Mini fridge with real freezer - cold enough to make ice cubes",
  "reviewDescription": "The fridge has two removable glass shelves, a white basket at the bottom to store fruit and veggies, and two storage racks at the door which I can remove as well. The separate freezer compartment on top is empty. The fridge includes a small ice tray. It’s a free-standing unit and uses a three-pronged plug. I can also change the side of the door. I measured the wall thickness of the freezer section, and it’s about 2 inches on the left and right sides; the top is about 2 ¼ inches thick. I also measured the freezer compartment’s depth, which is 14 ½ inches; the inside height is about 7 inches, and the width is 14 inches. The fridge compartment has a height of about 18 ¾ inches, and I measured its depth to be around 14 ¼ inches. The inside width of the fridge is about 15 ½ inches. The two glass shelves are each 9 ½ inches deep and 15 ¼ inches wide. At the bottom is a white basket that is about 15 inches wide and 5 inches deep. The height of this basket is 6 ¼ inches at the back and 5 inches at the front. The height between the very bottom inside and the lowest glass shelf is about 7 inches. The door has two racks—the bottom one’s height is about 5 inches deep, 12 ¾ inches wide, and 3 ¼ inches tall; the top rack is about 4 inches deep, 12 ¾ inches wide, and 1 ¾ inches tall. The fridge is all white inside and not difficult for me to clean as all surfaces are smooth. It doesn’t make a lot of noise. I set the freezer to the highest setting, 3. There is also a setting 0 which stops cooling - compressor turned off - but the refrigerator is still powered on. It also reaches cool temperatures in a short time. I waited about 30 minutes and the included ice cube trays already formed ice. At setting 3 and an indoor temperature of 72 degrees Fahrenheit, the thermometer I have inside the freezer compartment measures on average -4 degrees Fahrenheit, and inside the fridge, I get a temperature of around 31 degrees Fahrenheit. So the freezer compartment is cool enough - I can store frozen foods. But the fridge is too cold. That’s why I set the dial to 2 where the freezer temperature stays around 3 degrees Fahrenheit and the fridge is around 43 degrees Fahrenheit. One issue I initially had was the light not working. removed the temperature control panel housing to access the LED light board located on the right wall near the top. With the refrigerator powered on but the compressor turned off (temperature dial set to 0), I used a voltage tester to check the black and white wires leading to the LED light for current. The voltage test revealed that there was no current flowing through the black wire. The LED board appeared to be in good condition, so I suspected a problem with power delivery rather than a faulty LED module. This led me to focus on the power supply components. I then checked the door-activated light switch. I pressed and released the switch while testing for current changes, but I didn’t detect any changes. I suspected there was loose wiring. I unplugged the fridge. While carefully pulling out the light switch for a closer inspection, the wire terminals became disconnected. The wire leads were extremely short, and the wire terminals had crimped connector boots. There wasn't enough room for my fingers to reconnect the wires. After a few tries, I managed to reinsert the wire terminals back into their connector boots on the switch using long right-angle tweezers. I seated the switch back in place and plugged in the fridge. I was happy to find that the LED lights turned on. It took me 20 minutes to fix the lighting. I stuffed all the wires back into the panel housing and screwed it back in place And finally, I’m glad it doesn’t come with an egg tray, as it would be useless for me as a vegan and one less thing I would have to throw in the garbage."
},
{
  "ratingScore": 5,
  "reviewTitle": "Awesome!",
  "reviewDescription": "Really awesome fridge/freezer combo in a smaller form factor. I was currently using a wine cooler that only gets so cold. With this, I can have a freezer too! I really love it. Great for college, smaller apartments, bedrooms, gamerooms, ect!"
},
{
  "ratingScore": 5,
  "reviewTitle": "Basic no frills combination fridge/freezer - but that's what I like about it",
  "reviewDescription": "This is what I would consider a mid-sized \"mini\" fridge. Has a separate fridge and freezer space which is great for a dorm or college apartment setup, extra fridge in the basement for snacks/drinks, for the garage, workshop, home office, or in my case - my wife claimed it for her craft room. Hey, whatever gets her to use it (the craft room that is). The fridge is fairly basic, but in this case I think it speaks to simplicity - it does what it's supposed to do, it's not trying to be the center of attention. It's quiet and tucked out of the way, it's there when you need it. So grab a cold one of your choice and get back to work."
}]