[{
  "ratingScore": 4,
  "reviewTitle": "Looks nice and works well",
  "reviewDescription": "We’ve had this fridge for a few months now and really like it. It looks nice, was easy to install, is easy to open and close, and has great storage inside. It’s even easy for our toddler to open to help herself to items (and has a child lock setting for when we don’t want that). I took one star off because it can be pretty noisy, but not the end of the world for us."
},
{
  "ratingScore": 4,
  "reviewTitle": "holds temperature well",
  "reviewDescription": "Fridge holds 34 -35 degrees and is not too noisy. You can hear it running but it is not too noticeable. The thin stainless door face surface material came damaged twice. Amazon offered discounts on the first unit but I wanted it to look new in a new wet bar of a new home. The second unit came with similar damage but in a less conspicuous area. I don't feel like having to pull this one out like the last, move all the drinks and then dispose of all of the packaging again. The company made contact offering an acceptable solution other than attempting another delivery. They claim their pre shipping inspections and packaging should prevent such damage and believe it was due to shipping process after leaving their facility. Other than the cosmetic damage which maybe would have not happened with a third unit, the fridge works very well after a couple of months now. Overall for the price this a a very good value, if you can get an undamaged one it would be an amazing deal. If it had arrived dent free the second time it would be 5 stars all the way."
},
{
  "ratingScore": 5,
  "reviewTitle": "Works as it should",
  "reviewDescription": "I've only had this a week but so far so good. Keeps my beer cold! It did come dented on the top because UPS doesn't care what's in the box. It arrived upside down. I let it sit for over 24 hours right side up and it seems to be working just fine."
},
{
  "ratingScore": 4,
  "reviewTitle": "Overall a great purchase",
  "reviewDescription": "Overall a great purchase! Arrived on-time and not damaged. The fridge is the perfect size for my application, quiet and keeps beer cold. I have this installed as if it's a built in and it doesn't overheat. The only small issue is the corner of the doors finish (see Pic) is a little rough compared to the rest of the door, hard to see unless you're at a certain angle looking at it. Definitely recommend for the price."
},
{
  "ratingScore": 5,
  "reviewTitle": "HOLDS MUCH MORE THAN I EXPECTED! Love the look and it is perfect in my new remodeled kitchen!",
  "reviewDescription": "Even though this mini-fridge measures only 15\" wide... it holds a TON of water bottles! I can fit a 40-pack 16.9 oz water bottles in it with no problem and room to spare for my other misc drinks too! It keeps my bottles all perfect drinking termperature. Recommend highly."
}]