[{
  "ratingScore": 5,
  "reviewTitle": "Fridge perfect size",
  "reviewDescription": "Love all of it. Size was perfect. Lots of room ."
},
{
  "ratingScore": 5,
  "reviewTitle": "lots of room",
  "reviewDescription": "Quite large for a mini fridge. I like the room it has inside."
},
{
  "ratingScore": 1,
  "reviewTitle": "Too noisy to be a mini-fridge",
  "reviewDescription": "If you are considering using it as a mini-fridge in a bedroom or dorm room, don't go for it because it makes a lot of noise and you won't be able to sleep in the room where it is kept. Being a large item, it is also difficult to return, so it is better not to order. Had I known the noise issue earlier, I wouldn't have ordered."
},
{
  "ratingScore": 4,
  "reviewTitle": "Good but door is different",
  "reviewDescription": "Love it, works great BUT the door storage is completely different from what is pictured (for the larger of the two units). Look at the photos in the reviews to see the actual configuration. If you don't need a can dispenser (which I don't) it takes away about a quarter of the door storage."
},
{
  "ratingScore": 3,
  "reviewTitle": "It contiinues to make noise running",
  "reviewDescription": "Love the size, price was right, but it was for upstairs in bedroom, so I did not have to come downstairs to get a drink from kitchen refrigerator. Problem is, in the bedroom, it is so loud and when it turns off, it has another loud turn off noise. So thinking this would be like my camper frigerator, it is not. Why its so loud is beyond me. Keeps cold, but the running noises are too loud to keep in bedroom"
},
{
  "ratingScore": 5,
  "reviewTitle": "Great mini refrigerator",
  "reviewDescription": "very pleased with this mini refrigerator. It has enough space for a lot of things. It does not take up a lot of space and it looks very nice with steel doors. The only thing I don't like is that shelves on doors are not adjustable so there are space that is not usable because it is not big enough. It would be nice to be able to adjust shelves on door."
},
{
  "ratingScore": 4,
  "reviewTitle": "Nicely sized fridge, very effective",
  "reviewDescription": "Nice refrigerator, particularly for the size (it even has light when you open the door!). Filled a significant need for us, and affordably. Can dispenser is awesome and freezer is handy. Only wish the shelves were a little more spaced to hold a gallon of milk without removing one."
},
{
  "ratingScore": 3,
  "reviewTitle": "Very loud",
  "reviewDescription": "It is good looking unit. The first 5 or 6 hours it was plugged in the unit ran fairly quietly. Within less than 3 days, it became very very loud when cycling on. When it reaches correct temperature the noise lowers considerably. The problem is it frequently goes thru that cycling to maintain the correct temperature. So every couple of hours it sounds like a car is running. It can be heard in the room below it even with a TV on. I wouldn't buy it again. Very disappointing."
},
{
  "ratingScore": 5,
  "reviewTitle": "High quality frig.",
  "reviewDescription": "Super, really impressed by the quality. Works very well. Big note, the packaging was extremely well done. No shipping damages, not a scratch. Two doors, are really good. I'm impressed on every level. ( That don't happen often.)"
}]