[{
  "ratingScore": 5,
  "reviewTitle": "It's a good little fridge.",
  "reviewDescription": "It's perfect small size. Great price. Good deal."
},
{
  "ratingScore": 3,
  "reviewTitle": "Works!",
  "reviewDescription": "Have only had it a few weeks but, it seems to be working just fine. Very cute fridge and takes up not much space. I keep it in my garage. Update: So I've had this a bit longer now and my major complaint is, the freezer doesn't freeze! I have it now set at 4 out of 5 and it's like a really cold refrigerator. Ice Cream? Forget about it. Turns to liquid."
},
{
  "ratingScore": 4,
  "reviewTitle": "Nice. Needs defrosting often",
  "reviewDescription": "Cute. I like it. Arrived damaged but works. Very icey in the back. Needs frequent defrosting. 1x a month in summer and 1x every two months in Philadelphia winter. After a year is still working well."
},
{
  "ratingScore": 4,
  "reviewTitle": "Small Roomy Refrigerate with one flaw",
  "reviewDescription": "Perfect for the area we needed in, but freezes over inside the refrigerator part. The freezer works well with no issues. but the Refrigerator forms ice on the walls. Still think worth value but afraid we will have issues within six months."
},
{
  "ratingScore": 3,
  "reviewTitle": "This refrigerator is not as cool as it looks",
  "reviewDescription": "Except for the parts where it's freezing. Temperatures are very uneven; drinks toward the back will freeze. Made a racket for the first couple of months and then after we moved to another space it stopped. It looks cool and kind of retro but you can do better for the money."
},
{
  "ratingScore": 5,
  "reviewTitle": "Good value for extra refer.",
  "reviewDescription": "Item recieved in good shape, (some reviews complained it was damaged.) Mine was in pristene condition, packing very adiquate. Am using in garage as my temp variations are within the recommended range. Overall I am happy to say it has more than enought room to fit my requirments."
},
{
  "ratingScore": 5,
  "reviewTitle": "Awesome",
  "reviewDescription": "It got here before expected delivery and got cold really fast also came with an egg holder and ice tray over all awesome product definitely recommend"
},
{
  "ratingScore": 5,
  "reviewTitle": "Looks goods, operates nicely, and just generally a good buy.",
  "reviewDescription": "Love the retro look for my new apartment; runs quietly, lots of room inside without a large footprint in a small kitchen. Quite the find, actually!"
},
{
  "ratingScore": 3,
  "reviewTitle": "Damaged",
  "reviewDescription": "Corner smashed. Seems to work fine, but would love some cash back from the seller. If you are the seller, please contact me. Thanks!"
}
]