[{
  "ratingScore": 5,
  "reviewTitle": "works like a pro compact size and cool looking",
  "reviewDescription": "works perfect no noise or something what i have seen on other reviews looks great and the price is so good"
},
{
  "ratingScore": 4,
  "reviewTitle": "Great little fridge",
  "reviewDescription": "It has a good amount of space in both the freezer and regular fridge. Very quiet. It has the same smudge issuse as alll stainless steel."
},
{
  "ratingScore": 5,
  "reviewTitle": "Perfect size",
  "reviewDescription": "Saw bad reviews but bought anyway. Glad I did. It is perfect size and function well. The frig was in perfect order upon receiving."
},
{
  "ratingScore": 1,
  "reviewTitle": "Fridge with short life span",
  "reviewDescription": "Worked great for the first 3 weeks but stopped working after that, both the freezer and fridge portion. Not worth the price for such a short duration."
},
{
  "ratingScore": 3,
  "reviewTitle": "Cost More Than it's Worth",
  "reviewDescription": "Didn't realize that \"door to door\" delivery didn't mean I don't have to go to an Amazon facility to pick it up... it was dropped, literally, at my door. If I didn't have my furniture dolly handy, it would've been sitting on my front porch for almost a week before the install / haul away arrived. Freezer door hinge was bent. A dime sized dent in the refrigerator door aligned w/the 5\" gouge on the shipping box. Ice tray is a joke; buy a real-life one and toss the supplied, toy like, tray into the recycling. Shelf adjustment is next to useless; top shelf is too high for a gallon of milk. Placing it on the next supports down, makes the lower shelf(s) barely high enough for a 12 oz. can of soda. It is not frost free or; auto defrosting... they actually supply a mini scrapper for de-icing the back wall of the refrigerator and inside of the freezer. Noisy for a new refrigerator; my 35 y/o Amana was quieter"
},
{
  "ratingScore": 4,
  "reviewTitle": "Holds More than Expected & Maintains Correct Temp",
  "reviewDescription": "Although our unit arrived with exterior damage and broken door storage shelves, it still works well and maintains the correct temp. The doors are opened many times a day but still stays cold enough. We like the design and amount of food it holds. The top freezer also has a separate door and is larger than most apartment-sized refrigerators we researched. The seller has responded to our communications and offered a full replacement, but we could not box it back up for shipping. We also cannot find the manufacturer or replacement parts and the seller does not know where to find them either."
}]