[{
  "ratingScore": 5,
  "reviewTitle": "Great buy for a compact Fridge.",
  "reviewDescription": "It's been about almost a month and this fridge has treated me and my perishables very well. It's really quiet and it shouldn't bother you if you don't mind typical tiny fridge sounds. The temperature is great and easy to adjust. Awesome price for the size and quality. No dents and came in perfect condition. Installation is not needed as it comes as you see in the video. I thought I would have to put in the doors but they came installed already which is awesome. Only complaint which is irrelevant I'm pretty sure is that sometimes it'll make a sort of static discharging sound but I searched up what that might be and it's nothing to worry about so I don't have to worry about a fire going off while I sleep. Great fridge if you're looking to store small stuff. I recommend it if you're like me who just wants drinks on the go and ice cream or small frozen foods and left overs from Panda or chipotle or any restaurant stored nice and regulated. Also go watch/read One Piece and DanDaDan 🫡👍"
},
{
  "ratingScore": 5,
  "reviewTitle": "The price is great and you don’t need a lot of space excellent for student dorm",
  "reviewDescription": "Great refrigerator and so cute excellent for small space it even comes with a ice tray I loved it to me is very handy it fits anywhere.it runs wonderful.i highly recommended🥰"
},
{
  "ratingScore": 2,
  "reviewTitle": "Damaged at the factory",
  "reviewDescription": "I was looking forward to receiving this fridge but upon opening the box there was serious damage to the unit. The freezer was so dented it wouldn’t close correctly and the doors are off now as well. I was able to get the freezer door to close after a little adjustment but shouldn’t have had to do so in the first place. The box and shipping materials it came in showed no signs of damage so this was shipping out this way. The fridge itself is quite nice, quiet and cools quickly. Other than the damage I’m pretty happy with it. It’s livable as it is but would like to see better quality assurance from this manufacturer going forward."
},
{
  "ratingScore": 5,
  "reviewTitle": "Excellent price and good purchase",
  "reviewDescription": "I love my mini fridgerator!! It is nice in my bedroom, cool drinks, popsicles, great snack you can store. Nice purchase!!"
},
{
  "ratingScore": 5,
  "reviewTitle": "GREAT REFRIGERATOR. This one is the cat's MEOW",
  "reviewDescription": "This refrigerator was for my wife in the nursing home, and it is working out beautifully, It keeps stuff frozen and it keeps drinks cold and it is very quiet and it looks expensive, but it is not, I am glad I found this one, it is the only one I found that would go in the space allowed for this, I am very happy with every thing about it, It works perfectly and it fits perfectly, The Freezer can be opened from the Front, of course the refrigerator door is easily opened from the front also,"
}]