[{
  "ratingScore": 5,
  "reviewTitle": "Simple design so easy to clean with dishes",
  "reviewDescription": "Great outdoor bottle. Simple design -> easy to clean. Seals lock tight with no leak."
},
{
  "ratingScore": 4,
  "reviewTitle": "Great water bottle.",
  "reviewDescription": "I like the size. It's easy to fill and clean. one downside is the catch to release the lid sticks a lot."
},
{
  "ratingScore": 5,
  "reviewTitle": "Solid, quality, get it",
  "reviewDescription": "Love the Contigo water bottles. Only bought this because I lost my last one. They stand up well to abuse and daily wear & they have multiple options for cap/closure styles to meet different people's needs. Recommended!"
},
{
  "ratingScore": 1,
  "reviewTitle": "Love the autopop but not durable at all",
  "reviewDescription": "I love this bottle, the design is so sleek and the autopop feature works quite well. Unfortunately the autopop lid isn't very durable, I dropped it a week or two into receiving it and the handle immediately broke. I contacted them to see if they would honour their warranty but no response :\\ I also noticed it would leak when held upside down unless the lid was locked. Nonetheless, I loved it and used it still until after owning it for 6 months I noticed there was mold growing in the rubber seal of the autopop lid. The rubber seal is not removeable or cleanable on its own. I was only able to remove it by forcing it out which resulted in it getting damaged. I love the functionality of this bottle but the lid needs to be made much more durable and much easier to clean."
},
{
  "ratingScore": 4,
  "reviewTitle": "Not as water tight as I would like",
  "reviewDescription": "I love this brand and style. I have about 5 of them. These were a lesser quality than others from this brand. I will put a tablet that makes water fizzy and the air can escape but that doesn’t happen with my others."
},
{
  "ratingScore": 4,
  "reviewTitle": "Great bottle",
  "reviewDescription": "If the handle had the little clip so you can attach it to a bag or whatever, like some of their other models, it’d be 5 stars. Own a few contigo bottles and love their designs/features. Very well made, and they can take quite a bit of abuse."
},
{
  "ratingScore": 3,
  "reviewTitle": "It's okay but not as good as others of the same brand",
  "reviewDescription": "The lid sticks and doesn't just pop up when you press the button, like other Contigo water bottles do. For the price, it was disappointing that it doesn't function smoothly."
}]