[{
  "ratingScore": 5,
  "reviewTitle": "LOVE IT",
  "reviewDescription": "I needed something with a screw on lid so I could toss it in my bag. This is perfect. I love the extra lids it comes with. It keeps my water so cold as well. Perfect size."
},
{
  "ratingScore": 5,
  "reviewTitle": "Buy this instead of Yeti",
  "reviewDescription": "This is a great insulated 32oz container. I only use it for water and it keeps cold to last drop. It's comparable to a Yeti, feels sturdy like one. Little pricey at full cost but catch a deal and it's no brainer. Wouldn't think twice about buying another. It comes with an extra straw, the straw lid with straw installed, a chug lid that is retainer so you don't lose the cap and a full opened lid that when removed gives full mouth of jug."
},
{
  "ratingScore": 4,
  "reviewTitle": "the color is a bit more grey toned than whats shown",
  "reviewDescription": "As stated in the product it comes with three lids, two straws and a straw cleaner. The skull is kinda hard to see on the bottle, but i don't mind."
},
{
  "ratingScore": 4,
  "reviewTitle": "Great product but insulation requires some advance planning!",
  "reviewDescription": "High quality, keeps beverages cold (or hot), BUT there’s one catch. Not a big deal, but if you want very cold water in your bottle for a workout then you basically need to put very cold water in the bottle. In other words, the bottle is insulated well so putting room temperature water in the bottle and refrigerating won’t get the water very cold. Just something to keep in mind if you like your workout beverage nice and cold!"
},
{
  "ratingScore": 5,
  "reviewTitle": "Buena calidad",
  "reviewDescription": "Buen producto"
},
{
  "ratingScore": 5,
  "reviewTitle": "A+ Hydration Vessel",
  "reviewDescription": "Love this water bottle. Stylish matte black and engraved logos."
},
{
  "ratingScore": 1,
  "reviewTitle": "New and unused",
  "reviewDescription": "Really disappointed with this purchase. I’ve brought plenty of things from this brand and this was the first time I’m very disappointed with what I had received. Not only did the bottle seem like it was previously used because of scratches and fading, I also didn’t receive the other two top pieces. I want to order another one but afraid it will have the same outcome."
},
{
  "ratingScore": 5,
  "reviewTitle": "Good water bottle.",
  "reviewDescription": "This bottle was for my son who is in the Army. This is the one he always uses. When he lost his last one, he wanted the same exact one."
}]