[{
  "ratingScore": 5,
  "reviewTitle": "Miss the Old You, But You Are Still Good For Me",
  "reviewDescription": "Very durable, pretty colour on it as well. Size is universal and fits most backpack slots. I do miss the old kick starter cast cap that you can attach a carabiner to but it seems that was discontinued many years ago to my surprise. Great value bottle and helps keep your drinks cool."
},
{
  "ratingScore": 5,
  "reviewTitle": "great water bottle but...",
  "reviewDescription": "I got this size water bottle because it's not too big and not too small. I just used this in a Chevy suburban and the bottle fit just right in the cup holder. I got the lid without the straw and it has a nice carry handle. I will buy the lid with the straw for future use because it is not easy for me to drink from this bottle when the car is in motion. the car stopped and I wasn't paying attention and the water spilled on me. if I had a lid with a straw that would've never happened. the bottle is good as is for hiking because I can just stop and drink from my bottle. if you intend to use this in a vehicle I would get the lid with the straw. the bottle kept my drinks cold. didn't test it for hot drinks yet as I am writing this review in the summer. it was a little pricey for my usual budget but I find it is worth it because so far the bottle is very durable and it seems it will last a while. the bottle is also easy to clean. so far so good!"
},
{
  "ratingScore": 5,
  "reviewTitle": "Love this bottle",
  "reviewDescription": "I purchased this item because I now understand how important it is to switch out your bottles daily!!! This bottle is perfect for cold drinks. I even put ice in it and the ice will melt slowly. This is my second time ordering this item. I will order another very soon. I must say that even after the bottle is full, it is still lightweight!!! Fits in my cupholder and hand with ease. Also, I filled the bottle then turned it upside down, and nothing leaked out!!! Love that there is truth in advertising!!!"
},
{
  "ratingScore": 5,
  "reviewTitle": "Best thermal bottle",
  "reviewDescription": "This is the best thermal bottle brand I like. It doesn't have a straw or other bells and whistles, just simple bottle that's easy to keep clean. It keeps the temperature really well and doesn't leak. It also looks really cool. What else can you ask for."
},
{
  "ratingScore": 5,
  "reviewTitle": "I am both pleased and impressed!",
  "reviewDescription": "It about wore me out looking at insulated bottles with so many out there to choose from! I am a heavy coffee drinker and wanted to be able to carry a nice, fresh refill for my travel mug while out and about. I will begin by saying that the first photo in my review, does NOT accurately represent the actual color that I purchased, Agave. The fluorescent lights in my shop are not color friendly. The actual color is a soft greyish green, like sage leaves and is very pleasant. Edit to ad: We had a spot of sunshine on the back porch today, so I took it out in the sunshine for a better pic. Much better color representation in the last picture. Initially, I was looking in the $20 range and found a lot of products that were \"close\" to what I wanted, but no cigar. After looking at the Hydro Flask page and seeing that accessories and replacement parts are available, I decided it would be worth a try. At the steeper price, over twice the price in many cases, it was worth it to get exactly what I wanted. My search criteria was as follows: * A Wide Mouth: For ease of filling, cleaning, easy pouring and nice big gulps. No straw or spout to clean or fiddle with. . *A Plastic Stopper: Because stainless on stainless threads are prone to galling. * No Big, Fragile or Obtrusive Handle: Didn't want something that would break off or get in the way or a lanyard to collect crud. This handle is small, folds back unobtrusively and is flexible so shouldn't break if twisted or bumped. *Easy to fill with hot liquids or cold beverages with ice. *A Centered Spout: So I didn't have to look and align it every time I took a drink or poured from it. *Cup Holder friendly in my old Jeep *Nice color *Sturdy construction This has absolutely ticked all of the boxes. It's slim enough to hold comfortably, very attractive without being showy and well constructed. I think we're going to be coffee drinking buddies for a very long time."
},
{
  "ratingScore": 4,
  "reviewTitle": "Great for everyday",
  "reviewDescription": "Great value for the money. I purchased this a recent vacation and it fit in my bag perfectly and it kept my water cold and did spill. It is durable, however, it does dent pretty easily."
},
{
  "ratingScore": 5,
  "reviewTitle": "Works Great",
  "reviewDescription": "Love the color and durability. My husband uses this for work daily and it keeps his coffee hot. Also love that it is lead free."
}]