[{
  "ratingScore": 4,
  "reviewTitle": "Good but a weird chemical smell",
  "reviewDescription": "I've had this about three days. Pros: bottle large enough so that I don't need to keep refilling it throughout the day. good design Sleeves are nice and sleek CONS:I'd have given it 5 stars but there's an odd chemical/ plastic smell inside the lid and the straw. I've soaked it in soapy water and handwashed it a few times. However, the odd chemical smell persists on the straw and the inside of the lid; and that ends up making the water taste awful when using the straw. (The glass bottle doesn't have the chemical smell anymore after soaking it in soapy water and washing it 4 to 5 times). I haven't bothered taking this with me outside since I can't use the straw or lid without having the water taste like it has a chemical residue. So now, I just use the bottle without the lid and straw."
},
{
  "ratingScore": 3,
  "reviewTitle": "Thin glass. Useless wand tool",
  "reviewDescription": "Thin glass bottle. Cleaning wand broke as it was thin plastic. Hard to clean without a wand."
},
{
  "ratingScore": 5,
  "reviewTitle": "Good quality bottle",
  "reviewDescription": "Had this bottle for an about a month and anit now. Works as it should. Did mostly hot drinks for the first few weeks. Compared to your regular thermos doesn’t hold heat to long but still decent I’d say about 4Hrs at most for to still decently hot. Overall I quite like it. Epically with the schedule on the side to remind me to drink."
},
{
  "ratingScore": 2,
  "reviewTitle": "Leaking lid won’t stay on",
  "reviewDescription": "Started out good but the lid leaks and won’t stay on."
},
{
  "ratingScore": 4,
  "reviewTitle": "great. a little heavy to pack around though",
  "reviewDescription": "if you are stationary most of the time this is awesome."
},
{
  "ratingScore": 5,
  "reviewTitle": "Happy with purchased",
  "reviewDescription": "Nice and easy to clean!"
},
{
  "ratingScore": 2,
  "reviewTitle": "Disappointed – Lid Doesn’t Close Properly",
  "reviewDescription": "Same issue as others mentioned! Not meant to be carried around. The lid doesn’t close properly, it keeps turning and leaks."
}]