[{
  "ratingScore": 3,
  "reviewTitle": "Fabulous Thermos Properties",
  "reviewDescription": "I have bought many different kinds of thermos bottles from various hardware stores and I was always extremely disappointed because the bottles would not keep my water hot or cold for more than a few hours. This product has a fantastic ability to keep the contents at the same temperature they were when I first put them into the bottle. I found a great trick to help me. If I want to keep some Apple Juice ice cold, I create about six ice cubes made of the apple juice and put them into the bottle first. Then I fill the bottle with the cold apple juice. The ice cubes remain intact for almost 24 hours. I kid you not! This water bottle is the first and only product I have ever found that will do that for me. It is far more suitable and keeps my liquid cold for almost 24 hours. I haven't tried hot liquids yet. But I assume they will keep hot just as well as the cold liquids keep cold. I am incredibly happy to own a thermos water bottle that will keep my liquid contents at the original temperature. I would be happy to have paid $100 for this product. But I only had to pay $40. As soon as I experienced this bottle, I ordered two more for my two close friends. I wish this bottle came with some instructions on how to use the straw. It is pretty well self-evident but I just wish the product would explain how to make good use of the straw. I fear you may not publish the rest of this review because it concerns delivery and not product quality. If you have to delete the remainder of this review, I will understand. I was an Amazon customer for two years. I lived in a high rise apt building and I contacted Amazon customer service many times to complain I requested they leave my packages outside my door and knock when they delivered it. But they refused to come to my apt. door. Instead, they left my packages in the ground floor lobby where it was extremely easy for them to become lost or stolen. Ultimately, I had to cancel my Amazon account. Eventually they started leaving the packages outside my apartment door and I resumed buying from Amazon. I was very pleased about that. But there still remains one problem. I need the drivers to knock on my door when they leave my packages so I know they have been delivered. Otherwise, they sit outside my door for a very long time where they are easy to get lost or stolen. Your service is truly wonderful. But you could make it close to perfect if only you would knock on my aot, door when you leave a package so I will know to go and pick up the package. That would make your delivery service so very much better. Please help me with this? Thank you!"
},
{
  "ratingScore": 4,
  "reviewTitle": "I love the color and design",
  "reviewDescription": "I love this Owala water bottle. Very easy to hold on and open the cap with one hand. As I love it so much , I drink more water than usual. It might not fit to all car cup holder as it is a little bit wider. The weight of the water bottle is alright, much lighter than the same size of Yeti but heavier than Swell. Overall I am very happy , star took out due to not fit into my car’s cup holder."
},
{
  "ratingScore": 5,
  "reviewTitle": "Good quality and no more ice hitting your mouth while drinking.",
  "reviewDescription": "The 40oz bottle is pretty big and won’t fit in most cup holders (it fits fine in a cup holder extender), but I wanted extra capacity and that’s perfect for my needs. Also, it’s super easy to drink/sip from it, a real game changer for me compared to my older thermos bottle."
},
{
  "ratingScore": 5,
  "reviewTitle": "Wonderful",
  "reviewDescription": "Very good quality, we use it on a daily basis and it keeps water cold for many hours"
},
{
  "ratingScore": 5,
  "reviewTitle": "Amazing",
  "reviewDescription": "My last owala had mould in the lid so i disposed of it (I know I could clean it but mould makes me incredibly anxious) but I loved it so much I decided to buy another. It's the only water bottle I've ever liked."
},
{
  "ratingScore": 5,
  "reviewTitle": "Doesn't leak and keep the water cold for a very long time",
  "reviewDescription": "Absolutely love this water bottle. It is my first Owala and I love it. it keeps the water cold for a long time, and it doesn't leak. Fits in any car bottle holder I have encountered since I have it"
},
{
  "ratingScore": 4,
  "reviewTitle": "don't hesitate - best water bottle",
  "reviewDescription": "only deducting one star because of the price. but hands down the best water bottle. keeps things cold, so easy to clean, even my kids requested them. the only bottle i seem to buy now, have quite a few, and the only one my kids haven't lost yet because they themselves like it so much, they keep track of it."
}]